const langButtons = document.querySelectorAll("[data-btn]");
const allLangs = ["ru", "kz"];
const currentPathName = window.location.pathname;
let currentLang =localStorage.getItem("language") || checkBrowserLang() || "ru";
let currentTexts = {};


const homeTexts = {
  "index_btn-first": {
    ru: "Санаторий работает с 2006 года. Более 40 000 довольных клиентов",
    kz: "Шипажай 2006 жылдан бері жұмыс істейді. 40 000-нан астам қанағаттанған клиенттер",
  },
   "home_page-title": {
    ru: "Сарыагаш Санаторий АК — ЖАЙЫК — Собственный минеральный источник, Эффективный результат лечения, Комфортабельные номера",
    kz: "Сарыағаш Шипажайы АК — ЖАЙЫК — Өзінің минералды көзі, Емдеудің тиімді нәтижесі, Жайлы бөлмелер",
   },
   "menu-lang1": {
    ru: "Главная",
    kz: "Басты бет",
   },
   "menu-span_lang": {
    ru: "Меню",
    kz: "Мәзір",
   },
   "menu-lang2": {
    ru: "О санатории",
    kz: "Санаторий туралы",
   },
   "menu-langtwo": {
    ru: "О санатории",
    kz: "Санаторий туралы",
   },
   "menu-lang3": {
    ru: "Лечение",
    kz: "Емдеу",
   },
   "menu-langthree": {
    ru: "Лечение",
    kz: "Емдеу",
   },
   "menu-langthree3": {
    ru: "Лечение",
    kz: "Емдеу",
   },
   "menu-lang4": {
    ru: "Размещение",
    kz: "Орналастыру",
   },
   "menu-langfour": {
    ru: "Размещение",
    kz: "Орналастыру",
   },
   "menu-langfour4": {
    ru: "Размещение",
    kz: "Орналастыру",
   },
   "menu-lang5": {
    ru: "Отзывы",
    kz: "Пікірлер",
   },
   "menu-lang6": {
    ru: "Контакты",
    kz: "Байланыс",
   },
   "menu-langsix": {
    ru: "Контакты",
    kz: "Байланыс",
   },
   "menu-lang_one": {
    ru: "Главная",
    kz: "Басты бет",
   },
   "menu-lang_two": {
    ru: "О санатории",
    kz: "Санаторий туралы",
   },
   "menu-lang_three": {
    ru: "Лечение",
    kz: "Емдеу",
   },
   "menu-lang_four": {
    ru: "Размещение",
    kz: "Орналастыру",
   },
   "menu-lang_five": {
    ru: "Отзывы",
    kz: "Пікірлер",
   },
   "menu-lang_six": {
    ru: "Контакты",
    kz: "Байланыс",
   },
   "reserved-lang": {
    ru: "Забронировать номер",
    kz: "Бөлмені брондау",
   },
   "reserved-lang1": {
    ru: "Забронировать номер",
    kz: "Бөлмені брондау",
   },
   "standart3x-lang": {
    ru: "СТАНДАРТ 3-Х МЕСТНЫЙ 17 000 тг",
    kz: "3 ОРЫНДЫҚ СТАНДАРТ 17 000 тг",
   },
   "standart3x-lang1": {
    ru: "СТАНДАРТ 3-Х МЕСТНЫЙ 17 000 тг",
    kz: "3 ОРЫНДЫҚ СТАНДАРТ 17 000 тг",
   },
   "standart3x-lang2": {
    ru: "СТАНДАРТ 3-Х МЕСТНЫЙ 17 000 тг",
    kz: "3 ОРЫНДЫҚ СТАНДАРТ 17 000 тг",
   },
   "standart3x-lang3": {
    ru: "СТАНДАРТ 3-Х МЕСТНЫЙ 17 000 тг",
    kz: "3 ОРЫНДЫҚ СТАНДАРТ 17 000 тг",
   },
   "standart3x-lang_p": {
    ru: "Собственный минеральный источник, Эффективный результат лечения Комфортабельные номера, Скидки на ранее бронирование!",
    kz: "Өзінің минералды көзі, Емдеудің тиімді нәтижес. Жайлы бөлмелер, Ерте брондау жеңілдіктер!",
   },
   "osanatorii-h2": {
    ru: "Санаторий АК — ЖАЙЫК предлагает вам эффективное лечение и незабываемый отдых по приятным ценам!",
    kz: "АК — ЖАЙЫК санаторийі сізге тиімді емдеуді және жағымды бағамен ұмытылмас демалысты ұсынады!",
   },
   "osanatorii-p": {
    ru: "Санаторий АК — ЖАЙЫК находится в курортной зоне Сарыагаш и является одним из лучших санаториев курортной зоны. Весь комплекс выдержан в едином стиле, имеет удобные подъездные пути и благоустроенную территорию. Отдыхающим оказывают услуги квалифицированные врачи, вежливый медперсонал. Главным лечащим фактором является минеральная вода.",
    kz: "АК — ЖАЙЫК санаторийі Сарыағаш курорттық аймағында орналасқан және курорттық аймақтың ең үздік санаторийлерінің бірі болып табылады. Бүкіл кешен бір стильде жасалған, ыңғайлы кіреберіс жолдары мен абаттандырылған аумағы бар. Демалушыларға білікті дәрігерлер, сыпайы медперсонал қызмет көрсетеді. Негізгі емдік фактор - минералды су.",
   },
   "unasrabotayt-lang": {
    ru: "У нас работают высококвалифицированные врачи, которые позаботятся о вашем здоровье и отдыхе! Оцените наше гостеприимство на высшем уровне!",
    kz: "Бізде сіздің денсаулығыңыз бен демалысыңызды қамтамасыз ететін жоғары білікті дәрігерлер бар! Біздің қонақжайлылығымызды жоғары деңгейде бағалаңыз!",
   },
   "otsyvy-lang_h4": {
    ru: "Отзывы наших гостей ",
    kz: "Біздің қонақтардың пікірлері",
   },
   "komanda-lang": {
    ru: "Команда лучшего санатория АК — ЖАЙЫК приглашает вас провести время, наслаждаясь комфортным и незабываемым отдыхом.",
    kz: "АК — ЖАЙЫК үздік санаторийінің командасы алдағы демалыс күндерін біздің компанияда жайлы және ұмытылмас демалыспен өткізуге шақырады.",
   },
   "kak_dobratca-lang": {
    ru: "Как добраться",
    kz: "Қалай жетуге болады",
   },
   "provedite-otdyx_lang": {
    ru: "Проведите отдых на высшем уровне с АК — ЖАЙЫК",
    kz: "АК — ЖАЙЫК-пен жоғары деңгейдегі демалысты өткізіңіз",
   },
   "v_stoimost-lang": {
    ru: "В стоимость входит: 4-х разовое питание, высококачественное лечение и широкий спектр медицинских услуг (физотерапия, грязелечение, бальнеология, парафинотерапия, массаж, йога), сауны, открытый и закрытый бассейн",
    kz: "Бағаға кіреді: 4 рет тамақтану, жоғары сапалы емдеу және медициналық қызметтердің кең спектрі (физиотерапия, балшықпен емдеу, бальнеология, парафин терапиясы, массаж, йога), сауналар, ашық және жабық бассейн",
   },
   "polu_lux2x-lang1": {
    ru: "ПОЛУЛЮКС 2-Х МЕСТНЫЙ 20 000 тг ",
    kz: "ПОЛУЛЮКС 2 ОРЫНДЫҚ 20 000 тг",
   },
   "polu_lux2x-lang2": {
    ru: "ПОЛУЛЮКС 2-Х МЕСТНЫЙ 20 000 тг ",
    kz: "ПОЛУЛЮКС 2 ОРЫНДЫҚ 20 000 тг",
   },
   "polu_lux2x-lang3": {
    ru: "ПОЛУЛЮКС 2-Х МЕСТНЫЙ 20 000 тг ",
    kz: "ПОЛУЛЮКС 2 ОРЫНДЫҚ 20 000 тг",
   },
   "polu_lux2x-lang4": {
    ru: "ПОЛУЛЮКС 2-Х МЕСТНЫЙ 20 000 тг ",
    kz: "ПОЛУЛЮКС 2 ОРЫНДЫҚ 20 000 тг",
   },
   "polu_lux2x-lang5": {
    ru: "ПОЛУЛЮКС 2-Х МЕСТНЫЙ 20 000 тг ",
    kz: "ПОЛУЛЮКС 2 ОРЫНДЫҚ 20 000 тг",
   },
   "polu_lux2x-lang6": {
    ru: "ПОЛУЛЮКС 2-Х МЕСТНЫЙ 20 000 тг ",
    kz: "ПОЛУЛЮКС 2 ОРЫНДЫҚ 20 000 тг",
   },
   "standart3x_43-lang1": {
    ru: "43 Cтандартных номеров",
    kz: "43 стандартты нөмір",
   },
   "standart3x_43-lang2": {
    ru: "43 Cтандартных номеров",
    kz: "43 стандартты нөмір",
   },
   "standart3x_43-lang3": {
    ru: "43 Cтандартных номеров",
    kz: "43 стандартты нөмір",
   },
   "polu_lux2x_razdel-lang1": {
    ru: "Раздельная кровать",
    kz: "Бөлінген төсек",
   },
   "polu_lux2x_razdel-lang2": {
    ru: "Раздельная кровать",
    kz: "Бөлінген төсек",
   },
   "polu_lux2x_razdel-lang3": {
    ru: "Раздельная кровать",
    kz: "Бөлінген төсек",
   },
   "polu_lux2x_razdel-lang4": {
    ru: "Раздельная кровать",
    kz: "Бөлінген төсек",
   },
   "polu_lux2x_semeinyi-lang1": {
    ru: "Семейный номер",
    kz: "Отбасылық бөлме",
   },
   "polu_lux2x_semeinyi-lang2": {
    ru: "Семейный номер",
    kz: "Отбасылық бөлме",
   },
   "polu_lux2x_semeinyi-lang3": {
    ru: "Семейный номер",
    kz: "Отбасылық бөлме",
   },
   "polu_lux2x_semeinyi-lang4": {
    ru: "Семейный номер",
    kz: "Отбасылық бөлме",
   },
   "lux2x-lang1": {
    ru: "ЛЮКС 2-Х МЕСТНЫЙ 26 000 тг",
    kz: "ЛЮКС 2 орындық 26 000 тг",
   },
   "lux2x-lang2": {
    ru: "ЛЮКС 2-Х МЕСТНЫЙ 26 000 тг",
    kz: "ЛЮКС 2 орындық 26 000 тг",
   },
   "lux2x-lang3": {
    ru: "ЛЮКС 2-Х МЕСТНЫЙ 26 000 тг",
    kz: "ЛЮКС 2 орындық 26 000 тг",
   },
   "luchie_fitobary-lang1": {
    ru: "ЛУЧШИЕ ФИТОБАРЫ И РЕСТОРАНЫ",
    kz: "ЕҢ ЖАҚСЫ ФИТОБАРЛАР МЕН МЕЙРАМХАНАЛАР",
   },
   "luchie_fitobary-lang2": {
    ru: "ЛУЧШИЕ ФИТОБАРЫ И РЕСТОРАНЫ",
    kz: "ЕҢ ЖАҚСЫ ФИТОБАРЛАР МЕН МЕЙРАМХАНАЛАР",
   },
   "luchie_fitobary-lang3": {
    ru: "ЛУЧШИЕ ФИТОБАРЫ И РЕСТОРАНЫ",
    kz: "ЕҢ ЖАҚСЫ ФИТОБАРЛАР МЕН МЕЙРАМХАНАЛАР",
   },
   "luchie_fitobary_opis-lang1": {
    ru: "В перерывах между оздоровительными процедурами и прогулками, совершите гастрономическое путешествие по ресторанам внутри комплекса.",
    kz: "Сауықтыру процедуралары мен серуендер арасында кешен ішіндегі мейрамханаларға гастрономиялық саяхат жасаңыз.",
   },
   "luchie_fitobary_opis-lang2": {
    ru: "В перерывах между оздоровительными процедурами и прогулками, совершите гастрономическое путешествие по ресторанам внутри комплекса.",
    kz: "Сауықтыру процедуралары мен серуендер арасында кешен ішіндегі мейрамханаларға гастрономиялық саяхат жасаңыз.",
   },
   "luchie_fitobary_opis-lang3": {
    ru: "В перерывах между оздоровительными процедурами и прогулками, совершите гастрономическое путешествие по ресторанам внутри комплекса.",
    kz: "Сауықтыру процедуралары мен серуендер арасында кешен ішіндегі мейрамханаларға гастрономиялық саяхат жасаңыз.",
   },
   "ozdorovlenie-lang": {
    ru: "ОЗДОРОВЛЕНИЕ В УСЛОВИЯХ ПОЛНОГО КОМФОРТА",
    kz: "САУЫҚТЫРУ ТОЛЫҚ ЖАҒДАЙДА ЖАЙЛЫЛЫҚ",
   },
   "ozdorovlenie_p-lang": {
    ru: "Сарыагашская минеральная вода регулирует процессы обмена веществ, улучшает функционирование пищеварительного тракта, способствует выведению токсинов, шлаков и солей тяжелых металлов. Доказаны эффективность и безопасность, хорошая переносимость минеральной воды. Побочные действия редки и крайне малочисленны.",
    kz: "Сарыағаш минералды суы метаболизм процестерін реттейді, ас қорыту жолдарының жұмысын жақсартады, ауыр металдардың токсиндерін, токсиндерін және тұздарын кетіруге ықпал етеді. Тиімділігі мен қауіпсіздігі, минералды суға жақсы төзімділігі дәлелденді. Жанама әсерлер сирек кездеседі және өте аз.",
   },
   "tridtac_napr-lang": {
    ru: "30 направлений для взрослых и детей, включающих лечебные и профилактические процедуры, а также консультации профильных врачей.",
    kz: "Ересектер мен балаларға арналған емдеу және профилактикалық рәсімдерді, сондай-ақ бейінді дәрігерлердің консультацияларын қамтитын 30 жолдама.",
   },
   "dop_info-lang": {
    ru: "Для дополнительной информации обращайтесь по телефону, WhatsApp, Instagram",
    kz: "Қосымша ақпарат алу үшін хабарласыңыз  телефон, WhatsApp, Instagram арқылы",
   },
   "dop_info_adres-lang": {
    ru: "ЮКО, Сарыагашский район, Поселок Коктерек",
    kz: "Сарыағаш ауданы, Көктерек Кенті",
   },
   "o_komplekse-lang": {
    ru: "О комплексе",
    kz: "Кешен туралы",
   },
   "whatsapp-lang": {
    ru: "Написать в WhatsApp ",
    kz: "WhatsApp-қа жазу",
   },
   "telegram-lang": {
    ru: "Написать в Instagram",
    kz: "Instagram-да жазу",
   },
};

const kontaktyTexts = {
  "kontakt_btn-first": {
    ru: "Санаторий работает с 2006 года. Более 40 000 довольных клиентов",
    kz: "Шипажай 2006 жылдан бері жұмыс істейді. 40 000-нан астам қанағаттанған клиенттер",
  },
    "kontakt_menu-btn": {
        ru: "Меню",
        kz: "Мәзір",
      },
      "kontakt-title": {
        ru: "Контакты — Сарыагаш Санаторий АК — ЖАЙЫК",
        kz: "Байланыс — Сарыағаш Шипажайы АК — ЖАЙЫК",
      },
      "kontakt_menu-1": {
        ru: "Главная",
        kz: "Басты бет",
       },
      "kontakt_menu-2": {
        ru: "О санатории",
        kz: "Санаторий туралы",
       },
      "kontakt_menu-3": {
        ru: "Лечение",
        kz: "Емдеу",
       },
      "kontakt_menu-4": {
        ru: "Размещение",
        kz: "Орналастыру",
       },
      "kontakt_menu-5": {
        ru: "Отзывы",
        kz: "Пікірлер",
       },
      "kontakt_menu-6": {
        ru: "Контакты",
        kz: "Байланыс",
       },
       "kontakt_menu1": {
        ru: "Главная",
        kz: "Басты бет",
       },
      "kontakt_menu2": {
        ru: "О санатории",
        kz: "Санаторий туралы",
       },
      "kontakt_menu3": {
        ru: "Лечение",
        kz: "Емдеу",
       },
      "kontakt_menu4": {
        ru: "Размещение",
        kz: "Орналастыру",
       },
      "kontakt_menu5": {
        ru: "Отзывы",
        kz: "Пікірлер",
       },
      "kontakt_menu6": {
        ru: "Контакты",
        kz: "Байланыс",
       },
       "kontakt_dop_info": {
        ru: "Для дополнительной информации обращайтесь по телефону, WhatsApp, Instagram",
        kz: "Қосымша ақпарат алу үшін хабарласыңыз  телефон, WhatsApp, Instagram арқылы",
       },
       "kontakt_dop_info_adres": {
        ru: "ЮКО, Сарыагашский район, Поселок Коктерек",
        kz: "Сарыағаш ауданы, Көктерек Кенті",
       },
       "kontakt_o_komplekse": {
        ru: "О комплексе",
        kz: "Кешен туралы",
       },
       "kontakt_whatsapp": {
        ru: "Написать в WhatsApp ",
        kz: "WhatsApp-қа жазу",
       },
       "kontakt_telegram": {
        ru: "Написать в Instagram",
        kz: "Instagram-да жазу",
       },
       "kontakt_menu-nomer": {
        ru: "Забронировать номер",
        kz: "Бөлмені брондау",
      }, 
      "kontakt_lechenie-bot": {
        ru: "Лечение",
        kz: "Емдеу",
       },
       "kontakt_kontakty-bot": {
        ru: "Контакты",
        kz: "Байланыс",
       },
       "kontakt_razmeshenie-bot": {
        ru: "Размещение",
        kz: "Орналастыру",
       },
};


const lechenieTexts = {
  "lechenie_page-title": {
    ru: "Лечение — Сарыагаш Санаторий АК — ЖАЙЫК",
    kz: "Емдеу — Сарыағаш Шипажайы АК — ЖАЙЫК",
  },
  "lech_menu-btn": {
    ru: "Меню",
    kz: "Мәзір",
  },
  "lech_menu-lang1": {
    ru: "Главная",
    kz: "Басты бет",
   },
  "lech_menu-lang2": {
    ru: "О санатории",
    kz: "Санаторий туралы",
   },
  "lech_menu-lang3": {
    ru: "Лечение",
    kz: "Емдеу",
   },
  "lech_menu-lang4": {
    ru: "Размещение",
    kz: "Орналастыру",
   },
  "lech_menu-lang5": {
    ru: "Отзывы",
    kz: "Пікірлер",
   },
  "lech_menu-lang6": {
    ru: "Контакты",
    kz: "Байланыс",
   },
   "lech_menu-lang-1": {
    ru: "Главная",
    kz: "Басты бет",
   },
  "lech_menu-lang-2": {
    ru: "О санатории",
    kz: "Санаторий туралы",
   },
  "lech_menu-lang-3": {
    ru: "Лечение",
    kz: "Емдеу",
   },
  "lech_menu-lang-4": {
    ru: "Размещение",
    kz: "Орналастыру",
   },
  "lech_menu-lang-5": {
    ru: "Отзывы",
    kz: "Пікірлер",
   },
  "lech_menu-lang1-6": {
    ru: "Контакты",
    kz: "Байланыс",
   },
  "lech_menu-nomer": {
    ru: "Забронировать номер",
    kz: "Бөлмені брондау",
  },  
  "lech_main-name": {
    ru: "Собственный минеральный источник. Эффективный результат лечения",
    kz: "Өзінің минералды көзі. Емдеудің тиімді нәтижесі",
  },
  "lech_main-name2": {
    ru: "Собственный минеральный источник. Эффективный результат лечения",
    kz: "Өзінің минералды көзі. Емдеудің тиімді нәтижесі",
  },   
  "lech_lechenie1": {
    ru: "Лечение",
    kz: "Емдеу",
  },  
  "lech_main-h2": {
    ru: "ОЗДОРОВЛЕНИЕ В УСЛОВИЯХ ПОЛНОГО КОМФОРТА",
    kz: "САУЫҚТЫРУ ТОЛЫҚ ЖАҒДАЙДА ЖАЙЛЫЛЫҚ",
  },  
  "lech_mineral-voda": {
    ru: "Сарыагашская минеральная вода регулирует процессы обмена веществ, улучшает функционирование пищеварительного тракта, способствует выведению токсинов, шлаков и солей тяжелых металлов. Доказаны эффективность и безопасность, хорошая переносимость минеральной воды. Побочные действия редки и крайне малочисленны.",
    kz: "Сарыағаш минералды суы метаболизм процестерін реттейді, ас қорыту жолдарының жұмысын жақсартады, ауыр металдардың токсиндерін, токсиндерін және тұздарын кетіруге ықпал етеді. Тиімділігі мен қауіпсіздігі, минералды суға жақсы төзімділігі дәлелденді. Жанама әсерлер сирек кездеседі және өте аз.",
  },  
  "lech_30-napr": {
    ru: "30 направлений для взрослых и детей, включающих лечебные и профилактические процедуры, а также консультации профильных врачей.",
    kz: "Ересектер мен балаларға арналған емдеу және профилактикалық рәсімдерді, сондай-ақ бейінді дәрігерлердің консультацияларын қамтитын 30 жолдама.",
  },  
  "lech_spisok-strong": {
    ru: "Профиль лечения",
    kz: "Емдеу профилі",
  },
  "lech_spisok-1": {
    ru: "Желудочно-кишечный тракт (Эзофагиты, рефлюксэзофаиты, хронические гастриты, гастродуодениты, дуодениты, язвенная болезнь желудка и двенадцатиперстной кишки в стадии ремиссий, эрозий желудка, бульбиты, колиты, геморрой).",
    kz: "Асқазан-ішек жолдары (Эзофагиттер, рефлюкс эзофагиттері, созылмалы гастриттер, гастродуодениттер, дуодениттер, ремиссия кезеңіндегі асқазан мен он екі елі ішектің ойық жарасы, асқазан эрозиясы, булбиттер, колиттер, геморрой).",
  },
  "lech_spisok-2": {
    ru: "Желчевыделительная система (Хронические холециститы, желчекаменная болезни без нарушение проходимости, холоногиты, хронические панкреатиты).",
    kz: "Өт шығару жүйесі(Созылмалы холецистит, өт тас аурулары, өтімділіктің бұзылуы, холоногит, созылмалы панкреатит).",
  },  
  "lech_spisok-3": {
    ru: "Заболевание почек и мочевыделительная система (Пиелонефриты, циститы).",
    kz: "Бүйрек ауруы және зәр шығару жүйесі (Пиелонефрит, цистит).",
  },  
  "lech_spisok-4": {
    ru: "Нарушение обмена веществ (Сахарный диабет, ожирение).",
    kz: "Метаболикалық бұзылулар (Қант диабеті, семіздік).",
  },  
  "lech_spisok-5": {
    ru: "Гинекологические заболевание (Аднекситы, пальните, оофориты).",
    kz: "Гинекологиялық аурулар (Аднекситтер, пальниттер, оофориттер).",
  },  
  "lech_spisok-6": {
    ru: "Заболевание сердечно-сосудистый системы.",
    kz: "Жүрек-тамыр жүйесі ауруы.",
  },  
  "lech_spisok-7": {
    ru: "Заболевание опорно-двигательного аппарата.",
    kz: "Тірек-қимыл аппаратының ауруы.",
  },  
  "lech_spisok-8": {
    ru: "Урологические заболевания (Простатит, уретриты).",
    kz: "Урологиялық аурулар (Простатит, уретрит).",
  },  
  "lech_spisok-9": {
    ru: "Медикаментозное лечение.",
    kz: "Дәрі-дәрмекпен емдеу.",
  },
  "lech_dop_info-lang": {
    ru: "Для дополнительной информации обращайтесь по телефону, WhatsApp, Instagram",
    kz: "Қосымша ақпарат алу үшін хабарласыңыз  телефон, WhatsApp, Instagram арқылы",
  },
  "lech_dop_info_adres-lang": {
    ru: "ЮКО, Сарыагашский район, Поселок Коктерек",
    kz: "Сарыағаш ауданы, Көктерек Кенті",
  },
  "lech_o_komplekse-lang": {
    ru: "О комплексе",
    kz: "Кешен туралы",
  },
  "lech_whatsapp-lang": {
    ru: "Написать в WhatsApp ",
    kz: "WhatsApp-қа жазу",
  },
  "lech_telegram-lang": {
    ru: "Написать в Instagram",
    kz: "Instagram-да жазу",
  },
  "lech_lechenie-bot": {
    ru: "Лечение",
    kz: "Емдеу",
  },
  "lech_razmeshenie-bot": {
    ru: "Размещение",
    kz: "Орналастыру",
  },
  "lech_kontakty-bot": {
    ru: "Контакты",
    kz: "Байланыс",
  },
  "lech_btn-first": {
    ru: "Санаторий работает с 2006 года. Более 40 000 довольных клиентов",
    kz: "Шипажай 2006 жылдан бері жұмыс істейді. 40 000-нан астам қанағаттанған клиенттер",
  },     
};


const osanatoriiTexts = {
    "osan_title": {
        ru: "О санатории — Сарыагаш Санаторий АК — ЖАЙЫК",
        kz: "Санаторий туралы — Сарыағаш Шипажайы АК — ЖАЙЫК",
      },
      "osan_btn-first": {
        ru: "Санаторий работает с 2006 года. Более 40 000 довольных клиентов",
        kz: "Шипажай 2006 жылдан бері жұмыс істейді. 40 000-нан астам қанағаттанған клиенттер",
      },
    "osan_dop_info": {
        ru: "Для дополнительной информации обращайтесь по телефону, WhatsApp, Instagram",
        kz: "Қосымша ақпарат алу үшін хабарласыңыз  телефон, WhatsApp, Instagram арқылы",
      },
      "osan_dop_info_adres": {
        ru: "ЮКО, Сарыагашский район, Поселок Коктерек",
        kz: "Сарыағаш ауданы, Көктерек Кенті",
      },
      "osan_o_komplekse": {
        ru: "О комплексе",
        kz: "Кешен туралы",
      },
      "osan_whatsapp": {
        ru: "Написать в WhatsApp ",
        kz: "WhatsApp-қа жазу",
      },
      "osan_telegram": {
        ru: "Написать в Instagram",
        kz: "Instagram-да жазу",
      },
      "osan_lechenie": {
        ru: "Лечение",
        kz: "Емдеу",
      },
      "osan_razmeshenie": {
        ru: "Размещение",
        kz: "Орналастыру",
      },
      "osan_kontakt": {
        ru: "Контакты",
        kz: "Байланыс",
      },
      "osan_unasrabotayt": {
        ru: "У нас работают высококвалифицированные врачи, которые позаботятся о вашем здоровье и отдыхе! Оцените наше гостеприимство на высшем уровне!",
        kz: "Бізде сіздің денсаулығыңыз бен демалысыңызды қамтамасыз ететін жоғары білікті дәрігерлер бар! Біздің қонақжайлылығымызды жоғары деңгейде бағалаңыз!",
       },     
       "osan_sanatorii-h2": {
        ru: "Санаторий АК — ЖАЙЫК предлагает вам эффективное лечение и незабываемый отдых по приятным ценам!",
        kz: "АК — ЖАЙЫК санаторийі сізге тиімді емдеуді және жағымды бағамен ұмытылмас демалысты ұсынады!",
       },
       "osan_sanatorii-p": {
        ru: "Санаторий АК — ЖАЙЫК находится в курортной зоне Сарыагаш и является одним из лучших санаториев курортной зоны. Весь комплекс выдержан в едином стиле, имеет удобные подъездные пути и благоустроенную территорию. Отдыхающим оказывают услуги квалифицированные врачи, вежливый медперсонал. Главным лечащим фактором является минеральная вода. Санаторий работает с 2006 года. Более 40 000 довольных клиентов.",
        kz: "АК — ЖАЙЫК санаторийі Сарыағаш курорттық аймағында орналасқан және курорттық аймақтың ең үздік санаторийлерінің бірі болып табылады. Бүкіл кешен бір стильде жасалған, ыңғайлы кіреберіс жолдары мен абаттандырылған аумағы бар. Демалушыларға білікті дәрігерлер, сыпайы медперсонал қызмет көрсетеді. Негізгі емдік фактор - минералды су. Шипажай 2006 жылдан бері жұмыс істейді. 40 000-нан астам қанағаттанған клиенттер.",
       },
       "osan_sanatorii": {
        ru: "О санатории",
        kz: "Санаторий туралы",
       }, 
       "osan_off-site2": {
        ru: "Официальный сайт",
        kz: "Ресми сайт",
       },
       "osan_off-site": {
        ru: "Официальный сайт",
        kz: "Ресми сайт",
       },
       "osan_menu1": {
        ru: "Главная",
        kz: "Басты бет",
       },
    "osan_menu2": {
        ru: "О санатории",
        kz: "Санаторий туралы",
       },
    "osan_menu3": {
        ru: "Лечение",
        kz: "Емдеу",
       },
    "osan_menu4": {
        ru: "Размещение",
        kz: "Орналастыру",
       },
    "osan_menu5": {
        ru: "Отзывы",
        kz: "Пікірлер",
       },
    "osan_menu6": {
        ru: "Контакты",
        kz: "Байланыс",
       },
       "osan_menu-1": {
        ru: "Главная",
        kz: "Басты бет",
       },
    "osan_menu-2": {
        ru: "О санатории",
        kz: "Санаторий туралы",
       },
    "osan_menu-3": {
        ru: "Лечение",
        kz: "Емдеу",
       },
    "osan_menu-4": {
        ru: "Размещение",
        kz: "Орналастыру",
       },
    "osan_menu-5": {
        ru: "Отзывы",
        kz: "Пікірлер",
       },
    "osan_menu-6": {
        ru: "Контакты",
        kz: "Байланыс",
       },
       "osan_btn-header_menu": {
        ru: "Меню",
        kz: "Мәзір",
      },
     "osan_btn-header": {
        ru: "Забронировать номер",
        kz: "Бөлмені брондау",
      }, 
};

const otzyvyTexts = {
  "otz_btn-first": {
    ru: "Санаторий работает с 2006 года. Более 40 000 довольных клиентов",
    kz: "Шипажай 2006 жылдан бері жұмыс істейді. 40 000-нан астам қанағаттанған клиенттер",
  },
  "otz_btn-bot1": {
    ru: "Написать в WhatsApp ",
    kz: "WhatsApp-қа жазу",
  },
  "otz_btn-bot2": {
    ru: "Написать в Instagram",
    kz: "Instagram-да жазу",
  },  
  "otz_o_komplekse-bot1": {
    ru: "О комплексе",
    kz: "Кешен туралы",
  } ,
  "otz_lechenie-bot2": {
    ru: "Лечение",
    kz: "Емдеу",
  },
  "otz_raz-bot3": {
    ru: "Размещение",
    kz: "Орналастыру",
  },
  "otz_kontakt-bot4": {
    ru: "Контакты",
    kz: "Байланыс",
  },
  "otz_bot-adres": {
    ru: "ЮКО, Сарыагашский район, Поселок Коктерек",
    kz: "Сарыағаш ауданы, Көктерек Кенті",
  }, 
  "otz_bot-dop_info": {
    ru: "Для дополнительной информации обращайтесь по телефону, WhatsApp, Instagram",
    kz: "Қосымша ақпарат алу үшін хабарласыңыз  телефон, WhatsApp, Instagram арқылы",
  }, 
  "otz_main-otzyvy": {
    ru: "Отзывы наших гостей ",
    kz: "Біздің қонақтардың пікірлері",
   },
   "otz_menu-desktop1": {
    ru: "Главная",
    kz: "Басты бет",
   },
"otz_menu-desktop2": {
    ru: "О санатории",
    kz: "Санаторий туралы",
   },
"otz_menu-desktop3": {
    ru: "Лечение",
    kz: "Емдеу",
   },
"otz_menu-desktop4": {
    ru: "Размещение",
    kz: "Орналастыру",
   },
"otz_menu-desktop5": {
    ru: "Отзывы",
    kz: "Пікірлер",
   },
"otz_menu-desktop6": {
    ru: "Контакты",
    kz: "Байланыс",
   },
   "otz_menu-mobile1": {
    ru: "Главная",
    kz: "Басты бет",
   },
"otz_menu-mobile2": {
    ru: "О санатории",
    kz: "Санаторий туралы",
   },
"otz_menu-mobile3": {
    ru: "Лечение",
    kz: "Емдеу",
   },
"otz_menu-mobile4": {
    ru: "Размещение",
    kz: "Орналастыру",
   },
"otz_menu-mobile5": {
    ru: "Отзывы",
    kz: "Пікірлер",
   },
"otz_menu-mobile6": {
    ru: "Контакты",
    kz: "Байланыс",
   }, 
   "otz_header-menu": {
    ru: "Меню",
    kz: "Мәзір",
  },
  "otz_header-btn": {
    ru: "Забронировать номер",
    kz: "Бөлмені брондау",
  },  
  "otz_title": {
    ru: "Отзывы — Сарыагаш Санаторий АК — ЖАЙЫК",
    kz: "Пікірлер Сарыағаш Шипажайы АК — ЖАЙЫК",
  },
};


const razmeshhenieTexts = {
  "raz_btn-first": {
    ru: "Санаторий работает с 2006 года. Более 40 000 довольных клиентов",
    kz: "Шипажай 2006 жылдан бері жұмыс істейді. 40 000-нан астам қанағаттанған клиенттер",
  },
    "menu-langraz1": {
        ru: "Главная",
        kz: "Басты бет",
       },
    "menu-langraz2": {
        ru: "О санатории",
        kz: "Санаторий туралы",
       },
    "menu-langraz3": {
        ru: "Лечение",
        kz: "Емдеу",
       },
    "menu-langraz4": {
        ru: "Размещение",
        kz: "Орналастыру",
       },
    "menu-langraz5": {
        ru: "Отзывы",
        kz: "Пікірлер",
       },
    "menu-langraz6": {
        ru: "Контакты",
        kz: "Байланыс",
       },
    "menu-langraz_1": {
        ru: "Главная",
        kz: "Басты бет",
       },
    "menu-langraz_2": {
        ru: "О санатории",
        kz: "Санаторий туралы",
       },
    "menu-langraz_3": {
        ru: "Лечение",
        kz: "Емдеу",
       },
    "menu-langraz_4": {
        ru: "Размещение",
        kz: "Орналастыру",
       },
    "menu-langraz_5": {
        ru: "Отзывы",
        kz: "Пікірлер",
       },
    "menu-langraz_6": {
        ru: "Контакты",
        kz: "Байланыс",
       },
    "raz_btn-nomer": {
        ru: "Забронировать номер",
        kz: "Бөлмені брондау",
    },
    "raz_btn-menu": {
        ru: "Меню",
        kz: "Мәзір",
    },
    "raz_main-h2": {
        ru: "Комфортабельные номера, Скидки на ранее бронирование!",
        kz: "Жайлы бөлмелер, Ерте брондау жеңілдіктер!",
    },
    "raz_title": {
        ru: "Размещение — Сарыагаш Санаторий АК — ЖАЙЫК",
        kz: "Орналастыру — Сарыағаш Шипажайы АК — ЖАЙЫК",
    },
    "raz_main-comf": {
        ru: "Комфортабельные номера, Скидки на ранее бронирование!",
        kz: "Жайлы бөлмелер, Ерте брондау жеңілдіктер!",
    },
    "raz_h4-name": {
        ru: "Размещение",
        kz: "Орналастыру",
    },
    "raz_provedite": {
        ru: "Проведите отдых на высшем уровне с АК — ЖАЙЫК",
        kz: "АК — ЖАЙЫК-пен жоғары деңгейдегі демалысты өткізіңіз",
    },
    "raz_provedite-p": {
        ru: "В стоимость входит: 4-х разовое питание, высококачественное лечение и широкий спектр медицинских услуг (физотерапия, грязелечение, бальнеология, парафинотерапия, массаж, йога), сауны, открытый и закрытый бассейн",
        kz: "Бағаға кіреді: 4 рет тамақтану, жоғары сапалы емдеу және медициналық қызметтердің кең спектрі (физиотерапия, балшықпен емдеу, бальнеология, парафин терапиясы, массаж, йога), сауналар, ашық және жабық бассейн",
    },
    "standart3x_43-lang1": {
        ru: "43 Cтандартных номеров",
        kz: "43 стандартты нөмір",
    },
    "standart3x_43-lang2": {
        ru: "43 Cтандартных номеров",
        kz: "43 стандартты нөмір",
    },
    "standart3x_43-lang3": {
        ru: "43 Cтандартных номеров",
        kz: "43 стандартты нөмір",
    },
    "raz_standart3x-lang1": {
        ru: "СТАНДАРТ 3-Х МЕСТНЫЙ 17 000 тг",
        kz: "3 ОРЫНДЫҚ СТАНДАРТ 17 000 тг",
    },
    "raz_standart3x-lang2": {
        ru: "СТАНДАРТ 3-Х МЕСТНЫЙ 17 000 тг",
        kz: "3 ОРЫНДЫҚ СТАНДАРТ 17 000 тг",
    },
    "raz_standart3x-lang3": {
        ru: "СТАНДАРТ 3-Х МЕСТНЫЙ 17 000 тг",
        kz: "3 ОРЫНДЫҚ СТАНДАРТ 17 000 тг",
    },
    "raz_polu_lux2x-lang1": {
        ru: "ПОЛУЛЮКС 2-Х МЕСТНЫЙ 20 000 тг ",
        kz: "ПОЛУЛЮКС 2 ОРЫНДЫҚ 20 000 тг",
    },
    "raz_polu_lux2x-lang2": {
        ru: "ПОЛУЛЮКС 2-Х МЕСТНЫЙ 20 000 тг ",
        kz: "ПОЛУЛЮКС 2 ОРЫНДЫҚ 20 000 тг",
    },
    "raz_polu_lux2x-lang3": {
        ru: "ПОЛУЛЮКС 2-Х МЕСТНЫЙ 20 000 тг ",
        kz: "ПОЛУЛЮКС 2 ОРЫНДЫҚ 20 000 тг",
    },
    "raz_polu_lux2x-lang4": {
        ru: "ПОЛУЛЮКС 2-Х МЕСТНЫЙ 20 000 тг ",
        kz: "ПОЛУЛЮКС 2 ОРЫНДЫҚ 20 000 тг",
    },
    "raz_polu_lux2x-lang5": {
        ru: "ПОЛУЛЮКС 2-Х МЕСТНЫЙ 20 000 тг ",
        kz: "ПОЛУЛЮКС 2 ОРЫНДЫҚ 20 000 тг",
    },
    "raz_polu_lux2x-lang6": {
        ru: "ПОЛУЛЮКС 2-Х МЕСТНЫЙ 20 000 тг ",
        kz: "ПОЛУЛЮКС 2 ОРЫНДЫҚ 20 000 тг",
    },
    "raz_polu_lux2x_razdel-lang1": {
        ru: "Раздельная кровать",
        kz: "Бөлінген төсек",
    },
    "raz_polu_lux2x_razdel-lang2": {
        ru: "Раздельная кровать",
        kz: "Бөлінген төсек",
    },
    "raz_polu_lux2x_razdel-lang3": {
        ru: "Раздельная кровать",
        kz: "Бөлінген төсек",
    },
    "raz_polu_lux2x_razdel-lang4": {
        ru: "Раздельная кровать",
        kz: "Бөлінген төсек",
    },
    "raz-polu_lux2x_semeinyi-lang1": {
        ru: "Семейный номер",
        kz: "Отбасылық бөлме",
    },
    "raz-polu_lux2x_semeinyi-lang2": {
        ru: "Семейный номер",
        kz: "Отбасылық бөлме",
    },
    "raz-polu_lux2x_semeinyi-lang3": {
        ru: "Семейный номер",
        kz: "Отбасылық бөлме",
    },
    "raz-polu_lux2x_semeinyi-lang4": {
        ru: "Семейный номер",
        kz: "Отбасылық бөлме",
    },
    "raz-polu_lux2x_semeinyi-lang5": {
        ru: "Семейный номер",
        kz: "Отбасылық бөлме",
    },
    "raz_lux2x-lang1": {
        ru: "ЛЮКС 2-Х МЕСТНЫЙ 26 000 тг",
        kz: "ЛЮКС 2 орындық 26 000 тг",
    },
    "raz_lux2x-lang2": {
        ru: "ЛЮКС 2-Х МЕСТНЫЙ 26 000 тг",
        kz: "ЛЮКС 2 орындық 26 000 тг",
    },
    "raz_lux2x-lang3": {
        ru: "ЛЮКС 2-Х МЕСТНЫЙ 26 000 тг",
        kz: "ЛЮКС 2 орындық 26 000 тг",
    },
    "raz_dop_info-lang": {
        ru: "Для дополнительной информации обращайтесь по телефону, WhatsApp, Instagram",
        kz: "Қосымша ақпарат алу үшін хабарласыңыз  телефон, WhatsApp, Instagram арқылы",
    },
    "raz_dop_info_adres-lang": {
        ru: "ЮКО, Сарыагашский район, Поселок Коктерек",
        kz: "Сарыағаш ауданы, Көктерек Кенті",
    },
    "raz_o_komplekse-lang": {
        ru: "О комплексе",
        kz: "Кешен туралы",
    },
    "raz_whatsapp-lang": {
        ru: "Написать в WhatsApp ",
        kz: "WhatsApp-қа жазу",
    },
    "raz_telegram-lang": {
        ru: "Написать в Instagram",
        kz: "Instagram-да жазу",
    },
    "raz_lechenie-bot": {
        ru: "Лечение",
        kz: "Емдеу",
    },
    "raz_razmeshenie-bot": {
        ru: "Размещение",
        kz: "Орналастыру",
    },
    "raz_kontakty-bot": {
        ru: "Контакты",
        kz: "Байланыс",
    },
};

function checkPagePathName() {
    switch (currentPathName) {
        case '/index.html':
            currentTexts = homeTexts;
            break;
        case '/kontakty.html':
            currentTexts = kontaktyTexts;
            break;    
        case '/lechenie.html':
            currentTexts = lechenieTexts;
            break;
        case '/osanatorii.html':
            currentTexts = osanatoriiTexts;
            break;
        case '/otzyvy.html':
            currentTexts = otzyvyTexts;
            break;
        case '/razmeshhenie.html':
            currentTexts = razmeshhenieTexts;
            break;
        default:
            currentTexts = homeTexts;
            break;
    }
}

checkPagePathName();
console.log(currentPathName);

function changeLang() {
	for (const key in currentTexts) {
		let elem = document.querySelector(`[data-lang=${key}]`);
		if (elem) {
			elem.textContent = currentTexts[key][currentLang];
		}
	}
}
changeLang();


langButtons.forEach((btn) => {
	btn.addEventListener("click", (event) => {
		if (!event.target.classList.contains("header__btn_active")) {
			currentLang = event.target.dataset.btn;
			localStorage.setItem("language", event.target.dataset.btn);
			resetActiveClass(langButtons, "header__btn_active");
			btn.classList.add("header__btn_active");
			changeLang();
		}
	});
});

function resetActiveClass(arr, activeClass) {
	arr.forEach((elem) => {
		elem.classList.remove(activeClass);
	});
}

function checkActiveLangButton() {
	switch (currentLang) {
		case "ru":
			document
				.querySelector('[data-btn="ru"]')
				.classList.add("header__btn_active");
			break;
		case "en":
			document
				.querySelector('[data-btn="kz"]')
				.classList.add("header__btn_active");
			break;

		default:
			document
				.querySelector('[data-btn="ru"]')
				.classList.add("header__btn_active");
			break;
	}
}
checkActiveLangButton();

function checkBrowserLang() {
	const navLang = navigator.language.slice(0, 2).toLowerCase();
	const result = allLangs.some((elem) => {
		return elem === navLang;
	});
	if (result) {
		return navLang;
	}
}

console.log("navigator.language", checkBrowserLang());
